/*
Localizable.strings
PanicLibSSH2

Created by heather on 11/13/15.
Copyright © 2015 Panic. All rights reserved.
*/

"SSH initialization failed." = "SSH initialization failed.";
"SSH connection was cancelled." = "SSH 连接已取消。";
"Couldn't connect to server." = "无法连接到服务器。";
"Session startup failed." = "会话启动失败。";
"Password authentication not allowed." = "不允许密码鉴定。";
"Username or password was not accepted by the server." = "服务器不接受用户名或密码。";
"Key file was not accepted by the server." = "服务器不接受密钥文件。";
"Key file passphrase or authentication code was not accepted by the server." = "服务器不接受密钥文件密码或认证码。";
"Session request failed." = "会话请求失败。";
"PTY request failed." = "PTY 请求失败。";
"Shell request failed." = "Shell 请求失败。";
"Read data unavailable." = "读取数据不可用。";
"Verification code was not accepted by the server." = "服务器不接受验证码。";
"The %@ %@ fingerprint is:\n%@" = "%@ %@ 指纹为：\n%@";
"RSA" = "RSA";
"DSA" = "DSA";
"ECDSA" = "ECDSA";
"Ed25519" = "Ed25519";
"MD5" = "MD5";
"SHA1" = "SHA1";
"SHA256" = "SHA256";
"Unknown" = "未知";
"Connecting to Server." = "Connecting to Server.";

// SFTP Connection errors
"Connection cancelled." = "连接已取消。";
"Connection failed." = "连接失败。";
"Connection closed." = "连接已关闭。";
"An unexpected end of file error occurred." = "发生意外的文件结尾错误。";
"Command failed." = "命令失败。";
"Bad message." = "错误信息。";
"Read error." = "读取错误。";
"Write error." = "写入错误。";
"Remote stat failed." = "找不到文件。确保该文件未被意外移动或重新命名。";
"Local stat failed." = "找不到文件。确保该文件未被意外移动或重新命名。";
"Couldn't set local permissions." = "无法设置本地权限。";
"Couldn't set local file time." = "无法设置本地文件时间。";
"Can't download a directory." = "无法下载目录。";
"Couldn't get remote handle." = "无法获得远程处理。";
"Couldn't create local file." = "无法创建本地文件。";
"Data packet too big." = "数据包过大。";
"Attributes missing permissions." = "属性缺少权限。";
"Protocol error." = "协议错误。";
"Unable to extract public key from private key file." = "无法从专用密钥文件中提取公用密钥。";
"Could not establish a secure connection." = "无法建立安全连接。";
"File not found." = "找不到文件。";
"Make sure you have permission to modify this file." = "确保您有权修改此文件。";
"Not connected." = "未连接。";
"Server closed connection." = "服务器已关闭连接。";
"Operation not supported." = "操作不受支持。";
"Connection refused." = "连接被拒绝。";
"Stat failed." = "统计失败。";
"An SSH config file contains one or more errors. Please correct them to use this file." = "SSH 配置文件包含一个或多个错误。请更正这些错误以使用此文件。";
"Credentials were not accepted by the server." = "服务器不接受凭证。";
"Invalid port." = "无效端口。";
"Unable to forward port." = "无法转发端口。";

// PCSession propmts
" Please re-enter your key passphrase." = "请重输密钥密码短语。";
" Please re-enter your password." = "请重输您的密码。";
" Please re-enter your verification code." = "请重输验证码。";
"A verification code is required for %@" = "%@ 要验证码。";
"Please enter the pin for \"%@\"." = "请输入“%@”的 PIN 码。";
"Enter the key passphrase for \"%@\"." = "输入“%@”的密钥密码短语。";
" Please enter your key passphrase for \"%@\"." = " 请输入 “%@” 的密钥密码短语。";

// Server export
"Encrypted with passwords" = "使用了密码加密";
"Unencrypted without passwords" = "无密码未加密";
"export passwords" = "导出密码";
"Enter a unique password to protect the file containing your exported items." = "请输入唯一的密码以保护含有导出项的文件。";
"Transmit and Nova" = "Transmit 和 Nova";
"The password must be at least 12 characters long and will be used when importing into %@.\n\nThe encryption used on this file may become insecure in the future, so please delete all copies once you are finished with it." = "密码必须至少为 12 个字符长度，并将在导入 %@ 时使用。\n\n此文件上使用的加密将来可能变得不安全，因此请在完成使用该文件后删除所有副本。";
"Password:" = "密码：";
"Verify:" = "验证：";
"Unable to generate encryption key." = "无法生成加密密钥。";
"Unable to initialize encryption." = "无法初始化加密。";
"Encryption failed" = "加密失败。";
"Data is not encrypted." = "数据未加密。";
"Invalid encryption header." = "缺少加密头文件。";
"Unable to initialize decryption." = "无法初始化解密。";
"Decryption failed" = "解密失败。";
"Enter the passphrase used to encrypt the exported servers." = "输入用于加密导出服务器的密码短语。";

// SK Keys
"Unable to generate SK Key." = "无法生成 SK 密钥。";
"Please ensure your authenticator is connected and your PIN is correct." = "请确保您的身份验证器已连接，并且您的 PIN 码正确无误。";

// Ccertificates
"Untitled" = "未命名";
"None" = "无";
"Expires: " = "过期： ";
"Could not import data from file." = "无法从文件导入数据。";
